Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2025dar169.h
#define _GLCDCLUT219_RED_POSITION                0x00000010
#define _GLCDCLUT219_RED_MASK                    0x00FF0000
#define _GLCDCLUT219_RED_LENGTH                  0x00000008

#define _GLCDCLUT220_BLUE_POSITION               0x00000000
#define _GLCDCLUT220_BLUE_MASK                   0x000000FF
#define _GLCDCLUT220_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT220_GREEN_POSITION              0x00000008
#define _GLCDCLUT220_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT220_GREEN_LENGTH                0x00000008

#define _GLCDCLUT220_RED_POSITION                0x00000010
#define _GLCDCLUT220_RED_MASK                    0x00FF0000
#define _GLCDCLUT220_RED_LENGTH                  0x00000008

#define _GLCDCLUT221_BLUE_POSITION               0x00000000
#define _GLCDCLUT221_BLUE_MASK                   0x000000FF
#define _GLCDCLUT221_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT221_GREEN_POSITION              0x00000008
#define _GLCDCLUT221_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT221_GREEN_LENGTH                0x00000008

#define _GLCDCLUT221_RED_POSITION                0x00000010
#define _GLCDCLUT221_RED_MASK                    0x00FF0000
#define _GLCDCLUT221_RED_LENGTH                  0x00000008

#define _GLCDCLUT222_BLUE_POSITION               0x00000000
#define _GLCDCLUT222_BLUE_MASK                   0x000000FF
#define _GLCDCLUT222_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT222_GREEN_POSITION              0x00000008
#define _GLCDCLUT222_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT222_GREEN_LENGTH                0x00000008

#define _GLCDCLUT222_RED_POSITION                0x00000010
#define _GLCDCLUT222_RED_MASK                    0x00FF0000
#define _GLCDCLUT222_RED_LENGTH                  0x00000008

#define _GLCDCLUT223_BLUE_POSITION               0x00000000
#define _GLCDCLUT223_BLUE_MASK                   0x000000FF
#define _GLCDCLUT223_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT223_GREEN_POSITION              0x00000008
#define _GLCDCLUT223_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT223_GREEN_LENGTH                0x00000008

#define _GLCDCLUT223_RED_POSITION                0x00000010
#define _GLCDCLUT223_RED_MASK                    0x00FF0000
#define _GLCDCLUT223_RED_LENGTH                  0x00000008

#define _GLCDCLUT224_BLUE_POSITION               0x00000000
#define _GLCDCLUT224_BLUE_MASK                   0x000000FF
#define _GLCDCLUT224_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT224_GREEN_POSITION              0x00000008
#define _GLCDCLUT224_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT224_GREEN_LENGTH                0x00000008

#define _GLCDCLUT224_RED_POSITION                0x00000010
#define _GLCDCLUT224_RED_MASK                    0x00FF0000
#define _GLCDCLUT224_RED_LENGTH                  0x00000008

#define _GLCDCLUT225_BLUE_POSITION               0x00000000
#define _GLCDCLUT225_BLUE_MASK                   0x000000FF
#define _GLCDCLUT225_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT225_GREEN_POSITION              0x00000008
#define _GLCDCLUT225_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT225_GREEN_LENGTH                0x00000008

#define _GLCDCLUT225_RED_POSITION                0x00000010
#define _GLCDCLUT225_RED_MASK                    0x00FF0000
#define _GLCDCLUT225_RED_LENGTH                  0x00000008

#define _GLCDCLUT226_BLUE_POSITION               0x00000000
#define _GLCDCLUT226_BLUE_MASK                   0x000000FF
#define _GLCDCLUT226_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT226_GREEN_POSITION              0x00000008
#define _GLCDCLUT226_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT226_GREEN_LENGTH                0x00000008

#define _GLCDCLUT226_RED_POSITION                0x00000010
#define _GLCDCLUT226_RED_MASK                    0x00FF0000
#define _GLCDCLUT226_RED_LENGTH                  0x00000008

#define _GLCDCLUT227_BLUE_POSITION               0x00000000
#define _GLCDCLUT227_BLUE_MASK                   0x000000FF
#define _GLCDCLUT227_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT227_GREEN_POSITION              0x00000008
#define _GLCDCLUT227_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT227_GREEN_LENGTH                0x00000008

#define _GLCDCLUT227_RED_POSITION                0x00000010
#define _GLCDCLUT227_RED_MASK                    0x00FF0000
#define _GLCDCLUT227_RED_LENGTH                  0x00000008

#define _GLCDCLUT228_BLUE_POSITION               0x00000000
#define _GLCDCLUT228_BLUE_MASK                   0x000000FF
#define _GLCDCLUT228_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT228_GREEN_POSITION              0x00000008
#define _GLCDCLUT228_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT228_GREEN_LENGTH                0x00000008

#define _GLCDCLUT228_RED_POSITION                0x00000010
#define _GLCDCLUT228_RED_MASK                    0x00FF0000
#define _GLCDCLUT228_RED_LENGTH                  0x00000008

#define _GLCDCLUT229_BLUE_POSITION               0x00000000
#define _GLCDCLUT229_BLUE_MASK                   0x000000FF
#define _GLCDCLUT229_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT229_GREEN_POSITION              0x00000008
#define _GLCDCLUT229_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT229_GREEN_LENGTH                0x00000008

#define _GLCDCLUT229_RED_POSITION                0x00000010
#define _GLCDCLUT229_RED_MASK                    0x00FF0000
#define _GLCDCLUT229_RED_LENGTH                  0x00000008

#define _GLCDCLUT230_BLUE_POSITION               0x00000000
#define _GLCDCLUT230_BLUE_MASK                   0x000000FF
#define _GLCDCLUT230_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT230_GREEN_POSITION              0x00000008
#define _GLCDCLUT230_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT230_GREEN_LENGTH                0x00000008

#define _GLCDCLUT230_RED_POSITION                0x00000010
#define _GLCDCLUT230_RED_MASK                    0x00FF0000
#define _GLCDCLUT230_RED_LENGTH                  0x00000008

#define _GLCDCLUT231_BLUE_POSITION               0x00000000
#define _GLCDCLUT231_BLUE_MASK                   0x000000FF
#define _GLCDCLUT231_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT231_GREEN_POSITION              0x00000008
#define _GLCDCLUT231_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT231_GREEN_LENGTH                0x00000008

